{
    "script": [
        {
            "index": "6", 
            "title": "Good work!",
            "body": "Our algorithm is adjusting its recommendations based on your interactions and other data such as your watch time, scrolling patterns, and what people with similar behavior patterns liked. <br><br>Don't forget to continue using the like, share, and bookmark buttons to signal to the algorithm what to prioritize!",
            "buttons": ["Okay"],
            "buttonTriggers":  ["continue"]
        },


        {
            "index": "12",
            "dataId": "assumptions-template",
            "buttons": ["Yes", "No"],
            "buttonTriggers": ["preferences-match", "preferences-dont-match"]
        },
        {
            "trigger": "feedback-needed",
            "title": "Feedback",
            "body": "Are these assumptions accurate?",
            "buttons": ["Yes", "No", "Some of them"],
            "buttonTriggers": ["preferences-match", "preferences-dont-match", "preferences-dont-match"]
        },
        {
            "trigger": "preferences-match",
            "title": "Great!",
            "body": "We use the data we're collecting about you to make some <span class='keyword'>assumptions</span>, but these aren't always accurate. <br> <br> On other apps, this can correspond to your gender, age, race, or even favorite hobbies, leading to recommendations that may feel eerily specific. <br><br> Seeing what data we collected might help you understand how we got there: ",
            "buttons": ["Continue"],
            "buttonTriggers": ["show-preferences"]
        },
        {
            "trigger": "preferences-dont-match",
            "title": "Got it.",
            "body": "There can be a mismatch between the signals the algorithm picks up on and what we think they mean. <br><br> This can lead apps to incorrectly assuming your interests, characteristics, or demographics. <br><br>We'll want to try sharing the data we have on our users' preferences which go into these profiles. Click continue to see yours: ",
            "buttons": ["Continue"],
            "buttonTriggers": ["show-preferences"]
        },

        {
            "trigger": "show-preferences",
            "dataId": "preferences-template",
            "body": "<br>Learning what type of content you interact with most can help us understand what keeps you on our platform longest, regardless how you feel about it. <br><br>Here's how we've been weighing your interactions:",
            "buttons": ["View"],
            "buttonTriggers": ["algo-create"]
        },

        {
            "trigger": "algo-create",
            "dataId": "algorithm-create-template",
            "body": "<br>What if you could <span class='keyword'>control</span> these weightings? You can drag the bars above to change what the algorithm values more. <br> <br> On the upcoming screens, we try to be <span class='keyword'>more transparent</span>, too; click the menu on the bottom left to see the data we collect on you in real time.",
            "buttons": ["Done"],
            "buttonTriggers": ["unlock-menu"]
        },


        {
            "index": "25",
            "trigger": "hide-menu",
            "title": "<span class='smaller-title'>New Feature</span>",
            "body": "We hope that providing some transparency on how we're interpreting your interactions and what data we collected can help you engage with our app with greater control. <br><br> We're experimenting with a new feature where you can select from a number of algorithms to use in our app. <br><br>Here's a sneak peak of some examples of what these algorithms can look like.",
            "buttons": ["Explore"],
            "buttonTriggers": ["continue"]
        },
        {
            "index": "26",
            "dataId": "algorithm-select-template"
        },

        {
            "index": "27",
            "dataId": "algorithm-image-template",
            "title": "<span class='smaller-title'>Thanks for helping us make our app better!</span>",
            "body": "<span>Curious about what you've explored in this experience? Check out the game <a href='./debrief.html' style='color: #2251F8'>Replay the game. </a> <br><br> Want to learn more about algorithms, how they work, and their impact on our lives? Here are some extensive <a href='./resources.html' style='color: #2251F8'>Replay the game. </a>. <br><br> Wondering whether if you made different choices things would've looked different? <a href='./game.html' style='color: #2251F8'>Replay the game. </a></span>"
        }
    ]
}